cmsis-svd/cmsis-svd/data/STMicro/STM32F750x.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AC</name>
      <description>Access control</description>
      <groupName>AC</groupName>
      <baseAddress>0xE000EF90</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1D</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ITCMCR</name>
          <displayName>ITCMCR</displayName>
          <description>Instruction and Data Tightly-Coupled Memory
          Control Registers</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0X00000000</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMW</name>
              <description>RMW</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RETEN</name>
              <description>RETEN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SZ</name>
              <description>SZ</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DTCMCR</name>
          <displayName>DTCMCR</displayName>
          <description>Instruction and Data Tightly-Coupled Memory
          Control Registers</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0X00000000</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMW</name>
              <description>RMW</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RETEN</name>
              <description>RETEN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SZ</name>
              <description>SZ</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBPCR</name>
          <displayName>AHBPCR</displayName>
          <description>AHBP Control register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0X00000000</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SZ</name>
              <description>SZ</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CACR</name>
          <displayName>CACR</displayName>
          <description>Auxiliary Cache Control
          register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0X00000000</resetValue>
          <fields>
            <field>
              <name>SIWT</name>
              <description>SIWT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCEN</name>
              <description>ECCEN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FORCEWT</name>
              <description>FORCEWT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBSCR</name>
          <displayName>AHBSCR</displayName>
          <description>AHB Slave Control register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0X00000000</resetValue>
          <fields>
            <field>
              <name>CTL</name>
              <description>CTL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TPRI</name>
              <description>TPRI</description>
              <bitOffset>2</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>INITCOUNT</name>
              <description>INITCOUNT</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ABFSR</name>
          <displayName>ABFSR</displayName>
          <description>Auxiliary Bus Fault Status
          register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0X00000000</resetValue>
          <fields>
            <field>
              <name>ITCM</name>
              <description>ITCM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTCM</name>
              <description>DTCM</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBP</name>
              <description>AHBP</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXIM</name>
              <description>AXIM</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPPB</name>
              <description>EPPB</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXIMTYPE</name>
              <description>AXIMTYPE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
